content-org/all-posts.org
#+hugo_base_dir: ../
#+hugo_section: posts
#+title: Emacs 配置
#+hugo_tags:
#+hugo_categories:
#+hugo_auto_set_lastmod: t

* Emacs 基础设置配置

Niui
#+begin_src emacs-lisp :exports code
;;; init.el --- Emacs 基本配置
;;; Commentary:
;; 一个简洁实用的 Emacs 配置文件(使用 straight.el)

;;; Code:

;; 启动界面
(setq inhibit-startup-message t)
(add-hook 'prog-mode-hook #'display-line-numbers-mode)
(add-hook 'text-mode-hook #'display-line-numbers-mode)
(add-hook 'conf-mode-hook #'display-line-numbers-mode)
(column-number-mode t)
(global-hl-line-mode t)
(show-paren-mode t)
(electric-pair-mode t)
(delete-selection-mode 1)
;; 界面
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

;; 编辑
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
(setq c-basic-offset 4)

;; 备份
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))

;; 滚动
(setq scroll-step 1 scroll-conservatively 10000)
(global-auto-revert-mode t)

;; 历史
(save-place-mode t)
(recentf-mode t)
(setq recentf-max-saved-items 50)
(global-visual-line-mode 1)

;; 声音
(setq ring-bell-function 'ignore visible-bell t)

;; 编码
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
#+end_src

* 包管理

包管理相关配置，使用 straight.el 作为包管理器。

#+begin_src emacs-lisp
;; Straight.el 配置
(setq straight-built-in-pseudo-packages nil)
(setq straight-check-for-modifications '(check-on-save find-when-checking))

;; use-package
(straight-use-package 'project)
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)
#+end_src

* 字体与主题

#+begin_src emacs-lisp
;; 字体
(set-face-attribute 'default nil :font "Iosevka Nerd Font" :height 160)
(set-fontset-font t 'han "Noto Serif CJK SC")

;; 主题
(use-package doom-themes
  :config
  (load-theme 'doom-one t))
#+end_src

* 补全系统

#+begin_src emacs-lisp
;; Vertico
(use-package vertico
  :init (vertico-mode))

;; Orderless
(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

;; Marginalia
(use-package marginalia
  :init (marginalia-mode))

#+end_src

