content-org/all-posts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-21 Sat 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs 配置</title>
<meta name="author" content="罗耀辉" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs 配置</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org246ad5c">1. Emacs 基础设置配置</a></li>
<li><a href="#org23f9dbe">2. 包管理</a></li>
<li><a href="#orgda5202b">3. 字体与主题</a></li>
<li><a href="#orgfc9051e">4. 补全系统</a></li>
<li><a href="#org53f5abe">5. Consult</a></li>
<li><a href="#orgcdd4c6b">6. 导航工具</a></li>
<li><a href="#org0ec1658">7. 图标</a></li>
<li><a href="#org8fee476">8. 笔记系统</a></li>
<li><a href="#orgbc5c9f2">9. 中文输入</a></li>
<li><a href="#org16d4611">10. Org Mode</a></li>
<li><a href="#orgbb576c4">11. 开发工具</a></li>
<li><a href="#org9b5680e">12. 自定义函数</a></li>
</ul>
</div>
</div>
<div id="outline-container-org246ad5c" class="outline-2">
<h2 id="org246ad5c"><span class="section-number-2">1.</span> Emacs 基础设置配置</h2>
<div class="outline-text-2" id="text-1">
<p>
Niui
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><span style="color: #5B6268;">;;; </span><span style="color: #5B6268;">init.el --- Emacs &#22522;&#26412;&#37197;&#32622;
</span><span style="color: #5B6268;">;;; </span><span style="color: #5B6268;">Commentary:
</span><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#19968;&#20010;&#31616;&#27905;&#23454;&#29992;&#30340; Emacs &#37197;&#32622;&#25991;&#20214;(&#20351;&#29992; straight.el)
</span>
<span style="color: #5B6268;">;;; </span><span style="color: #5B6268;">Code:
</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#21551;&#21160;&#30028;&#38754;
</span>(<span style="color: #51afef;">setq</span> inhibit-startup-message t)
(add-hook 'prog-mode-hook #'display-line-numbers-mode)
(add-hook 'text-mode-hook #'display-line-numbers-mode)
(add-hook 'conf-mode-hook #'display-line-numbers-mode)
(column-number-mode t)
(global-hl-line-mode t)
(show-paren-mode t)
(electric-pair-mode t)
(delete-selection-mode 1)
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#30028;&#38754;
</span>(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#32534;&#36753;
</span>(<span style="color: #51afef;">setq-default</span> indent-tabs-mode nil)
(<span style="color: #51afef;">setq-default</span> tab-width 4)
(<span style="color: #51afef;">setq</span> c-basic-offset 4)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#22791;&#20221;
</span>(<span style="color: #51afef;">setq</span> backup-directory-alist '((<span style="color: #98be65;">"."</span> . <span style="color: #98be65;">"~/.emacs.d/backups"</span>)))
(<span style="color: #51afef;">setq</span> auto-save-file-name-transforms '((<span style="color: #98be65;">".*"</span> <span style="color: #98be65;">"~/.emacs.d/auto-save-list/"</span> t)))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#28378;&#21160;
</span>(<span style="color: #51afef;">setq</span> scroll-step 1 scroll-conservatively 10000)
(global-auto-revert-mode t)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#21382;&#21490;
</span>(save-place-mode t)
(recentf-mode t)
(<span style="color: #51afef;">setq</span> recentf-max-saved-items 50)
(global-visual-line-mode 1)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#22768;&#38899;
</span>(<span style="color: #51afef;">setq</span> ring-bell-function 'ignore visible-bell t)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#32534;&#30721;
</span>(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org23f9dbe" class="outline-2">
<h2 id="org23f9dbe"><span class="section-number-2">2.</span> 包管理</h2>
<div class="outline-text-2" id="text-2">
<p>
包管理相关配置，使用 straight.el 作为包管理器。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Straight.el &#37197;&#32622;
</span>(<span style="color: #51afef;">setq</span> straight-built-in-pseudo-packages nil)
(<span style="color: #51afef;">setq</span> straight-check-for-modifications '(check-on-save find-when-checking))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">use-package
</span>(straight-use-package 'project)
(straight-use-package 'use-package)
(<span style="color: #51afef;">setq</span> straight-use-package-by-default t)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgda5202b" class="outline-2">
<h2 id="orgda5202b"><span class="section-number-2">3.</span> 字体与主题</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#23383;&#20307;
</span>(set-face-attribute 'default nil <span style="color: #c678dd;">:font</span> <span style="color: #98be65;">"Iosevka Nerd Font"</span> <span style="color: #c678dd;">:height</span> 160)
(set-fontset-font t 'han <span style="color: #98be65;">"Noto Serif CJK SC"</span>)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#20027;&#39064;
</span>(<span style="color: #51afef;">use-package</span> doom-themes
  <span style="color: #c678dd;">:config</span>
  (load-theme 'doom-one t))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgfc9051e" class="outline-2">
<h2 id="orgfc9051e"><span class="section-number-2">4.</span> 补全系统</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Vertico
</span>(<span style="color: #51afef;">use-package</span> vertico
  <span style="color: #c678dd;">:init</span> (vertico-mode))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Orderless
</span>(<span style="color: #51afef;">use-package</span> orderless
  <span style="color: #c678dd;">:custom</span>
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Marginalia
</span>(<span style="color: #51afef;">use-package</span> marginalia
  <span style="color: #c678dd;">:init</span> (marginalia-mode))

</code></pre>
</div>
</div>
</div>
