content-org/all-posts.org
* Consult

#+begin_src emacs-lisp
(use-package consult
  :bind (
         ;; C-c C-c 空格 - 最常用：查找文件
         ("C-c C-c SPC" . consult-find)       ;; <leader><space> Find Files
         
         ;; C-c , - 快速切换buffer
         ("C-c ," . consult-buffer)           ;; <leader>, Buffers
         
         ;; C-c / - 当前文件搜索
         ("C-c /" . consult-line)             ;; <leader>/ Grep current buffer
         
         ;; C-c : - 命令历史
         ("C-c :" . consult-complex-command)  ;; <leader>: Command History
         
         ;; C-c f - 文件操作
         ("C-c f f" . consult-find)           ;; <leader>ff Find Files
         ("C-c f r" . consult-recent-file)    ;; <leader>fr Recent files
         ("C-c f b" . consult-buffer)         ;; <leader>fb Buffers
         ("C-c f c" . find-file)              ;; <leader>fc Find Config (可自定义)
         ("C-c f g" . consult-git-grep)       ;; <leader>fg git-files相关
         ("C-c f n" . consult-notes)
         ;; C-c s - 搜索操作
         ("C-c s g" . consult-ripgrep)        ;; <leader>sg Grep (Root Dir)
         ("C-c s G" . consult-grep)           ;; <leader>sG Grep (cwd)
         ("C-c s w" . consult-ripgrep)        ;; <leader>sw search word
         ("C-c s b" . consult-line)           ;; <leader>sb Buffer Lines
         ("C-c s B" . consult-line-multi)     ;; <leader>sB Grep Open Buffers
         ("C-c s d" . consult-flymake)        ;; <leader>sd Diagnostics
         ("C-c s h" . consult-history)        ;; <leader>sh Help/History
         ("C-c s m" . consult-mark)           ;; <leader>sm Marks
         ("C-c s j" . consult-outline)        ;; <leader>sj Jumps (outline)
         ("C-c s k" . describe-bindings)      ;; <leader>sk Keymaps
         ("C-c s s" . consult-imenu)          ;; <leader>ss Symbols
         ("C-c s S" . consult-imenu-multi)    ;; <leader>sS LSP Workspace Symbols
         
         ;; C-c b - Buffer操作
         ("C-c b b" . consult-buffer)         ;; <leader>bb Switch to Other Buffer
         ("C-c b d" . kill-buffer)            ;; <leader>bd Delete Buffer
         
         ;; C-c g - Git操作
         ("C-c g g" . consult-git-grep)       ;; <leader>gg (配合gitui等)
         
         ;; C-c x - 诊断/Quickfix
         ("C-c x q" . consult-compile-error)  ;; <leader>xq Quickfix List
         ("C-c s e" . consult-flymake)        ;; <leader>xl diagnostics
         
         ;; 替换默认命令
         ("C-x b" . consult-buffer)
         ("M-g g" . consult-goto-line)
         ("M-g i" . consult-imenu)
         ("M-g I" . consult-imenu-multi)
         ("M-y" . consult-yank-pop)
         
         ;; isearch 增强
         :map isearch-mode-map
         ("M-s l" . consult-line)
         
         ;; minibuffer 历史
         :map minibuffer-local-map
         ("M-r" . consult-history))
  
  :hook (completion-list-mode . consult-preview-at-point-mode)
  
  :init
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)
  
  :config
  (setq consult-narrow-key "<")
  (setq consult-preview-key 'any)
  
  (setq consult-ripgrep-args
        "rg --null --line-buffered --color=never --max-columns=1000 --path-separator=/ --smart-case --no-heading --with-filename --line-number --search-zip"))
#+end_src

