content-org/all-posts.html
<div id="outline-container-org53f5abe" class="outline-2">
<h2 id="org53f5abe"><span class="section-number-2">5.</span> Consult</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="color: #51afef;">use-package</span> consult
  <span style="color: #c678dd;">:bind</span> (
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">C-c C-c &#31354;&#26684; - &#26368;&#24120;&#29992;&#65306;&#26597;&#25214;&#25991;&#20214;
</span>         (<span style="color: #98be65;">"C-c C-c SPC"</span> . consult-find)       <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;&lt;space&gt; Find Files
</span>         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">C-c , - &#24555;&#36895;&#20999;&#25442;buffer
</span>         (<span style="color: #98be65;">"C-c ,"</span> . consult-buffer)           <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;, Buffers
</span>         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">C-c / - &#24403;&#21069;&#25991;&#20214;&#25628;&#32034;
</span>         (<span style="color: #98be65;">"C-c /"</span> . consult-line)             <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;/ Grep current buffer
</span>         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">C-c : - &#21629;&#20196;&#21382;&#21490;
</span>         (<span style="color: #98be65;">"C-c :"</span> . consult-complex-command)  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;: Command History
</span>         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">C-c f - &#25991;&#20214;&#25805;&#20316;
</span>         (<span style="color: #98be65;">"C-c f f"</span> . consult-find)           <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;ff Find Files
</span>         (<span style="color: #98be65;">"C-c f r"</span> . consult-recent-file)    <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;fr Recent files
</span>         (<span style="color: #98be65;">"C-c f b"</span> . consult-buffer)         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;fb Buffers
</span>         (<span style="color: #98be65;">"C-c f c"</span> . find-file)              <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;fc Find Config (&#21487;&#33258;&#23450;&#20041;)
</span>         (<span style="color: #98be65;">"C-c f g"</span> . consult-git-grep)       <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;fg git-files&#30456;&#20851;
</span>         (<span style="color: #98be65;">"C-c f n"</span> . consult-notes)
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">C-c s - &#25628;&#32034;&#25805;&#20316;
</span>         (<span style="color: #98be65;">"C-c s g"</span> . consult-ripgrep)        <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sg Grep (Root Dir)
</span>         (<span style="color: #98be65;">"C-c s G"</span> . consult-grep)           <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sG Grep (cwd)
</span>         (<span style="color: #98be65;">"C-c s w"</span> . consult-ripgrep)        <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sw search word
</span>         (<span style="color: #98be65;">"C-c s b"</span> . consult-line)           <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sb Buffer Lines
</span>         (<span style="color: #98be65;">"C-c s B"</span> . consult-line-multi)     <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sB Grep Open Buffers
</span>         (<span style="color: #98be65;">"C-c s d"</span> . consult-flymake)        <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sd Diagnostics
</span>         (<span style="color: #98be65;">"C-c s h"</span> . consult-history)        <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sh Help/History
</span>         (<span style="color: #98be65;">"C-c s m"</span> . consult-mark)           <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sm Marks
</span>         (<span style="color: #98be65;">"C-c s j"</span> . consult-outline)        <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sj Jumps (outline)
</span>         (<span style="color: #98be65;">"C-c s k"</span> . describe-bindings)      <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sk Keymaps
</span>         (<span style="color: #98be65;">"C-c s s"</span> . consult-imenu)          <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;ss Symbols
</span>         (<span style="color: #98be65;">"C-c s S"</span> . consult-imenu-multi)    <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;sS LSP Workspace Symbols
</span>         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">C-c b - Buffer&#25805;&#20316;
</span>         (<span style="color: #98be65;">"C-c b b"</span> . consult-buffer)         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;bb Switch to Other Buffer
</span>         (<span style="color: #98be65;">"C-c b d"</span> . kill-buffer)            <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;bd Delete Buffer
</span>         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">C-c g - Git&#25805;&#20316;
</span>         (<span style="color: #98be65;">"C-c g g"</span> . consult-git-grep)       <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;gg (&#37197;&#21512;gitui&#31561;)
</span>         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">C-c x - &#35786;&#26029;/Quickfix
</span>         (<span style="color: #98be65;">"C-c x q"</span> . consult-compile-error)  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;xq Quickfix List
</span>         (<span style="color: #98be65;">"C-c s e"</span> . consult-flymake)        <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&lt;leader&gt;xl diagnostics
</span>         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#26367;&#25442;&#40664;&#35748;&#21629;&#20196;
</span>         (<span style="color: #98be65;">"C-x b"</span> . consult-buffer)
         (<span style="color: #98be65;">"M-g g"</span> . consult-goto-line)
         (<span style="color: #98be65;">"M-g i"</span> . consult-imenu)
         (<span style="color: #98be65;">"M-g I"</span> . consult-imenu-multi)
         (<span style="color: #98be65;">"M-y"</span> . consult-yank-pop)
         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">isearch &#22686;&#24378;
</span>         <span style="color: #c678dd;">:map</span> isearch-mode-map
         (<span style="color: #98be65;">"M-s l"</span> . consult-line)
         
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">minibuffer &#21382;&#21490;
</span>         <span style="color: #c678dd;">:map</span> minibuffer-local-map
         (<span style="color: #98be65;">"M-r"</span> . consult-history))
  
  <span style="color: #c678dd;">:hook</span> (completion-list-mode . consult-preview-at-point-mode)
  
  <span style="color: #c678dd;">:init</span>
  (<span style="color: #51afef;">setq</span> xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)
  
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> consult-narrow-key <span style="color: #98be65;">"&lt;"</span>)
  (<span style="color: #51afef;">setq</span> consult-preview-key 'any)
  
  (<span style="color: #51afef;">setq</span> consult-ripgrep-args
        <span style="color: #98be65;">"rg --null --line-buffered --color=never --max-columns=1000 --path-separator=/ --smart-case --no-heading --with-filename --line-number --search-zip"</span>))
</code></pre>
</div>
</div>
</div>
