content-org/all-posts.org
* 导航工具

#+begin_src emacs-lisp
(use-package centaur-tabs
  :straight t
  :demand t
  :config
  (centaur-tabs-mode t)
  (setq centaur-tabs-style "bar"
        centaur-tabs-height 32
        centaur-tabs-set-icons t
        centaur-tabs-set-bar 'over
        centaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker "●"
        centaur-tabs-close-button "✕"
        centaur-tabs-gray-out-icons 'buffer)
  :bind
  ("C-c t h" . centaur-tabs-forward-tab)   ; 原生切换下一个 buffer 的方向键
  ("C-c t l "  . centaur-tabs-backward-tab)) ; 原生切换上一个 buffer 的方向键

;; Helpful
(use-package helpful
  :bind
  ([remap describe-function] . helpful-function)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key))

;; Avy
(use-package avy
  :bind (("C-." . avy-goto-char)
         ("C-'" . avy-goto-line)))

;; Flash-emacs
(use-package flash-emacs
  :straight (flash-emacs :type git :host github :repo "JiaweiChenC/flash-emacs")
  :bind (("C-s" . flash-emacs-jump))
  :config
  (setq flash-emacs-dim-background nil)
  (setq flash-emacs-case-sensitive 'smart))

;; Ace-window
(use-package ace-window
  :bind ("M-o" . ace-window))

;; Expand-region
(use-package expand-region
  :bind ("C-=" . er/expand-region))

(use-package nerd-icons)

;; 1. imenu-list - 统一的大纲视图
(use-package imenu-list
  :bind (("C-c o" . imenu-list-smart-toggle)
         ("C-c O" . imenu-list-focus))
  :config
  (setq imenu-list-focus-after-activation t
        imenu-list-auto-resize t
        imenu-list-position 'right
        imenu-list-size 0.25
        imenu-list-after-jump-hook nil))

;; 增强 org-mode 的 imenu 支持
(use-package org
  :config
  (setq org-imenu-depth 4))  ;; 显示4级标题
#+end_src

* 图标

#+begin_src emacs-lisp
(use-package nerd-icons)

(use-package nerd-icons-dired
  :hook (dired-mode . nerd-icons-dired-mode)
  :config
  (add-to-list 'nerd-icons-extension-icon-alist
               '("epub" nerd-icons-faicon "nf-fa-book" :face nerd-icons-green)))

(use-package nerd-icons-completion
  :config (nerd-icons-completion-mode))
#+end_src

* 笔记系统

#+begin_src emacs-lisp
(use-package ox-hugo
  :after ox
  :config
  (setq org-hugo-base-dir "~/blog/")
  (setq org-hugo-default-section-directory "posts")
  (setq org-hugo-auto-set-lastmod t)
  (setq org-hugo-default-static-subdirectory-for-externals "ox-hugo"))

;; Denote
(use-package denote
  :config
  (setq denote-directory (expand-file-name "~/workspace/notes/")))

;; Consult-dir
(use-package consult-dir
  :defer t
  :bind ((:map vertico-map ("C-x C-d" . consult-dir)))
  :config
  (setq consult-dir-default-command #'consult-dir-dired)
  
  (defun consult-dir--zoxide-dirs ()
    (split-string (shell-command-to-string "zoxide query -l") "\n" t))
  
  (defvar consult-dir--source-zoxide
    `(:name "zoxide"
            :narrow ?z
            :category file
            :face consult-file
            :history file-name-history
            :enabled ,(lambda () (executable-find "zoxide"))
            :items ,#'consult-dir--zoxide-dirs))
  
  (add-to-list 'consult-dir-sources 'consult-dir--source-zoxide t))

;; Consult-notes
(use-package consult-notes
  :commands (consult-notes
             consult-notes-search-in-all-notes)
  :config
  (setq consult-notes-file-dir-sources '(("Notes" ?n "~/workspace/notes/")))
  
  (when (locate-library "denote")
    (consult-notes-denote-mode)
    (setq consult-notes-denote-files-function
          (lambda () (denote-directory-files nil t t)))))

(use-package pdf-tools
  :config
  (pdf-tools-install)
  (setq-default pdf-view-display-size 'fit-page)
  :hook (pdf-view-mode . (lambda ()
                           (blink-cursor-mode -1))))
#+end_src

* 中文输入

#+begin_src emacs-lisp
(use-package pyim
  :config
  (setq pyim-default-scheme 'quanpin))

(defun my/orderless-regexp (orig-func component)
  (let ((result (funcall orig-func component)))
    (if (string-match-p "^[a-z]+$" component)
        (pyim-cregexp-build component)
      result)))

(advice-add 'orderless-regexp :around #'my/orderless-regexp)
#+end_src

