content-org/all-posts.html
<div id="outline-container-orgcdd4c6b" class="outline-2">
<h2 id="orgcdd4c6b"><span class="section-number-2">6.</span> 导航工具</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="color: #51afef;">use-package</span> centaur-tabs
  <span style="color: #c678dd;">:straight</span> t
  <span style="color: #c678dd;">:demand</span> t
  <span style="color: #c678dd;">:config</span>
  (centaur-tabs-mode t)
  (<span style="color: #51afef;">setq</span> centaur-tabs-style <span style="color: #98be65;">"bar"</span>
        centaur-tabs-height 32
        centaur-tabs-set-icons t
        centaur-tabs-set-bar 'over
        centaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker <span style="color: #98be65;">"&#9679;"</span>
        centaur-tabs-close-button <span style="color: #98be65;">"&#10005;"</span>
        centaur-tabs-gray-out-icons 'buffer)
  <span style="color: #c678dd;">:bind</span>
  (<span style="color: #98be65;">"C-c t h"</span> . centaur-tabs-forward-tab)   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">&#21407;&#29983;&#20999;&#25442;&#19979;&#19968;&#20010; buffer &#30340;&#26041;&#21521;&#38190;
</span>  (<span style="color: #98be65;">"C-c t l "</span>  . centaur-tabs-backward-tab)) <span style="color: #5B6268;">; </span><span style="color: #5B6268;">&#21407;&#29983;&#20999;&#25442;&#19978;&#19968;&#20010; buffer &#30340;&#26041;&#21521;&#38190;
</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Helpful
</span>(<span style="color: #51afef;">use-package</span> helpful
  <span style="color: #c678dd;">:bind</span>
  ([remap describe-function] . helpful-function)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Avy
</span>(<span style="color: #51afef;">use-package</span> avy
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-."</span> . avy-goto-char)
         (<span style="color: #98be65;">"C-'"</span> . avy-goto-line)))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Flash-emacs
</span>(<span style="color: #51afef;">use-package</span> flash-emacs
  <span style="color: #c678dd;">:straight</span> (flash-emacs <span style="color: #c678dd;">:type</span> git <span style="color: #c678dd;">:host</span> github <span style="color: #c678dd;">:repo</span> <span style="color: #98be65;">"JiaweiChenC/flash-emacs"</span>)
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-s"</span> . flash-emacs-jump))
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> flash-emacs-dim-background nil)
  (<span style="color: #51afef;">setq</span> flash-emacs-case-sensitive 'smart))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Ace-window
</span>(<span style="color: #51afef;">use-package</span> ace-window
  <span style="color: #c678dd;">:bind</span> (<span style="color: #98be65;">"M-o"</span> . ace-window))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Expand-region
</span>(<span style="color: #51afef;">use-package</span> expand-region
  <span style="color: #c678dd;">:bind</span> (<span style="color: #98be65;">"C-="</span> . er/expand-region))

(<span style="color: #51afef;">use-package</span> nerd-icons)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">1. imenu-list - &#32479;&#19968;&#30340;&#22823;&#32434;&#35270;&#22270;
</span>(<span style="color: #51afef;">use-package</span> imenu-list
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-c o"</span> . imenu-list-smart-toggle)
         (<span style="color: #98be65;">"C-c O"</span> . imenu-list-focus))
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> imenu-list-focus-after-activation t
        imenu-list-auto-resize t
        imenu-list-position 'right
        imenu-list-size 0.25
        imenu-list-after-jump-hook nil))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#22686;&#24378; org-mode &#30340; imenu &#25903;&#25345;
</span>(<span style="color: #51afef;">use-package</span> org
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> org-imenu-depth 4))  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#26174;&#31034;4&#32423;&#26631;&#39064;</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org0ec1658" class="outline-2">
<h2 id="org0ec1658"><span class="section-number-2">7.</span> 图标</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="color: #51afef;">use-package</span> nerd-icons)

(<span style="color: #51afef;">use-package</span> nerd-icons-dired
  <span style="color: #c678dd;">:hook</span> (dired-mode . nerd-icons-dired-mode)
  <span style="color: #c678dd;">:config</span>
  (add-to-list 'nerd-icons-extension-icon-alist
               '(<span style="color: #98be65;">"epub"</span> nerd-icons-faicon <span style="color: #98be65;">"nf-fa-book"</span> <span style="color: #c678dd;">:face</span> nerd-icons-green)))

(<span style="color: #51afef;">use-package</span> nerd-icons-completion
  <span style="color: #c678dd;">:config</span> (nerd-icons-completion-mode))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org8fee476" class="outline-2">
<h2 id="org8fee476"><span class="section-number-2">8.</span> 笔记系统</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="color: #51afef;">use-package</span> ox-hugo
  <span style="color: #c678dd;">:after</span> ox
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> org-hugo-base-dir <span style="color: #98be65;">"~/blog/"</span>)
  (<span style="color: #51afef;">setq</span> org-hugo-default-section-directory <span style="color: #98be65;">"posts"</span>)
  (<span style="color: #51afef;">setq</span> org-hugo-auto-set-lastmod t)
  (<span style="color: #51afef;">setq</span> org-hugo-default-static-subdirectory-for-externals <span style="color: #98be65;">"ox-hugo"</span>))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Denote
</span>(<span style="color: #51afef;">use-package</span> denote
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> denote-directory (expand-file-name <span style="color: #98be65;">"~/workspace/notes/"</span>)))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Consult-dir
</span>(<span style="color: #51afef;">use-package</span> consult-dir
  <span style="color: #c678dd;">:defer</span> t
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #c678dd;">:map</span> vertico-map (<span style="color: #98be65;">"C-x C-d"</span> . consult-dir)))
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> consult-dir-default-command #'consult-dir-dired)
  
  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">consult-dir--zoxide-dirs</span> ()
    (split-string (shell-command-to-string <span style="color: #98be65;">"zoxide query -l"</span>) <span style="color: #98be65;">"\n"</span> t))
  
  (<span style="color: #51afef;">defvar</span> <span style="color: #dcaeea;">consult-dir--source-zoxide</span>
    `(<span style="color: #c678dd;">:name</span> <span style="color: #98be65;">"zoxide"</span>
            <span style="color: #c678dd;">:narrow</span> ?z
            <span style="color: #c678dd;">:category</span> file
            <span style="color: #c678dd;">:face</span> consult-file
            <span style="color: #c678dd;">:history</span> file-name-history
            <span style="color: #c678dd;">:enabled</span> ,(<span style="color: #51afef;">lambda</span> () (executable-find <span style="color: #98be65;">"zoxide"</span>))
            <span style="color: #c678dd;">:items</span> ,#'consult-dir--zoxide-dirs))
  
  (add-to-list 'consult-dir-sources 'consult-dir--source-zoxide t))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Consult-notes
</span>(<span style="color: #51afef;">use-package</span> consult-notes
  <span style="color: #c678dd;">:commands</span> (consult-notes
             consult-notes-search-in-all-notes)
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> consult-notes-file-dir-sources '((<span style="color: #98be65;">"Notes"</span> ?n <span style="color: #98be65;">"~/workspace/notes/"</span>)))
  
  (<span style="color: #51afef;">when</span> (locate-library <span style="color: #98be65;">"denote"</span>)
    (consult-notes-denote-mode)
    (<span style="color: #51afef;">setq</span> consult-notes-denote-files-function
          (<span style="color: #51afef;">lambda</span> () (denote-directory-files nil t t)))))

(<span style="color: #51afef;">use-package</span> pdf-tools
  <span style="color: #c678dd;">:config</span>
  (pdf-tools-install)
  (<span style="color: #51afef;">setq-default</span> pdf-view-display-size 'fit-page)
  <span style="color: #c678dd;">:hook</span> (pdf-view-mode . (<span style="color: #51afef;">lambda</span> ()
                           (blink-cursor-mode -1))))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgbc5c9f2" class="outline-2">
<h2 id="orgbc5c9f2"><span class="section-number-2">9.</span> 中文输入</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="color: #51afef;">use-package</span> pyim
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> pyim-default-scheme 'quanpin))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/orderless-regexp</span> (orig-func component)
  (<span style="color: #51afef;">let</span> ((result (funcall orig-func component)))
    (<span style="color: #51afef;">if</span> (string-match-p <span style="color: #98be65;">"^[a-z]+$"</span> component)
        (pyim-cregexp-build component)
      result)))

(advice-add 'orderless-regexp <span style="color: #c678dd;">:around</span> #'my/orderless-regexp)
</code></pre>
</div>
</div>
</div>
