content-org/all-posts.org
* Org Mode

#+begin_src emacs-lisp
;; Org-download
(use-package org-download
  :after org
  :config
  (setq org-download-heading-lvl nil)
  (setq org-download-file-format-function
        (lambda (filename)
          (let* ((heading (org-get-heading t t t t))
                 (clean-heading (if heading
                                    (replace-regexp-in-string "[^a-zA-Z0-9\u4e00-\u9fa5]+" "-" heading)
                                  "img"))
                 (timestamp (format-time-string "%Y%m%d-%H%M%S"))
                 (ext (file-name-extension filename)))
            (format "%s_%s.%s" clean-heading timestamp ext))))
  ;; 用 advice 强制设置保存目录
  (advice-add 'org-download-screenshot :before
              (lambda (&rest _)
                (setq org-download-image-dir
                      (let ((dir (concat (file-name-sans-extension (buffer-file-name)) "/")))
                        (make-directory dir t)
                        dir)))))

;; Org-superstar
(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '(?◉ ?○ ?✸ ?✿ ?◆ ?▶))
  (setq org-superstar-item-bullet-alist '((?+ . ?➤) (?* . ?•) (?- . ?⁍)))
  (with-eval-after-load 'org-superstar
    (set-face-attribute 'org-superstar-item nil :foreground "#D7AF5F")
    (set-face-attribute 'org-superstar-leading nil :foreground "#7A6A3A"))
  (setq org-superstar-special-todo-items t)
  (setq org-superstar-todo-bullet-alist '(("TODO" . ?☐) ("DONE" . ?☑) ("WAIT" . ?⧗)))
  (setq org-superstar-remove-leading-stars t))

;; Org-appear
(use-package org-appear
  :after org
  :hook (org-mode . org-appear-mode)
  :custom
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t))

;; Org-present
(use-package org-present
  :after org
  :bind (:map org-present-mode-keymap
              ("C-c C-n" . org-present-next)
              ("C-c C-p" . org-present-prev)))

(defun my/org-present-start ()
  (org-present-big)
  (setq header-line-format " ")
  (text-scale-set 3)
  (setq cursor-type nil)
  (display-line-numbers-mode -1))

(defun my/org-present-end ()
  (org-present-small)
  (setq header-line-format nil)
  (text-scale-set 0)
  (setq cursor-type 'bar)
  (display-line-numbers-mode 1))

(add-hook 'org-present-mode-hook #'my/org-present-start)
(add-hook 'org-present-mode-quit-hook #'my/org-present-end)

;; Org 基础配置
(setq org-hide-emphasis-markers t)
(setq org-hide-block-startup t)
(setq org-startup-indented t)
(setq org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-src-preserve-indentation t)
(setq org-image-align 'center)

;; Org 图片预览配置
(setq org-startup-with-inline-images t)
(setq org-image-actual-width '(400))

(use-package org-roam
  :custom
  (org-roam-directory (file-truename "~/Workspace/notes"))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n g" . org-roam-graph)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n c" . org-roam-capture)
         ;; Dailies
         ("C-c n j" . org-roam-dailies-capture-today))
  :config
  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:20}" 'face 'org-tag)))
  (org-roam-db-autosync-mode)
  (require 'org-roam-dailies)
  (require 'org-roam-protocol))

(use-package org-roam-ui
  :after org-roam
  :custom
  (org-roam-ui-sync-theme t)
  (org-roam-ui-follow t)
  (org-roam-ui-update-on-save t))

;; Org Babel
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (C . t)
   (python . t)
   (shell . t)))

;;org_latex
(setenv "TEXINPUTS"
        (concat (expand-file-name "~/.emacs.d/latex/") ":"
                (getenv "TEXINPUTS")))

(setq org-latex-image-default-width "0.6\\linewidth")

(with-eval-after-load 'ox-latex
  (dolist (cls '(("cs-note_org" "\\documentclass{cs-note_org}
[NO-DEFAULT-PACKAGES]
[PACKAGES]
[EXTRA]")
                 ("note_org" "\\documentclass{note_org}
[NO-DEFAULT-PACKAGES]
[PACKAGES]
[EXTRA]")))
    (add-to-list 'org-latex-classes
                 (append cls
                         '(("\\section{%s}" . "\\section*{%s}")
                           ("\\subsection{%s}" . "\\subsection*{%s}")
                           ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))))

(setq org-latex-compiler "xelatex")
(setq org-latex-pdf-process
      '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

;; 使用 minted
(setq org-latex-listings 'minted)

;; 语言映射
(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-minted-langs '(emacs-lisp "common-lisp"))
  (add-to-list 'org-latex-minted-langs '(elisp "common-lisp")))

;; minted 选项
(setq org-latex-minted-options
      '(("fontsize" "\\small")
        ("breaklines" "true")
        ("breakanywhere" "true")
        ("bgcolor" "boxback")
        ("frame" "leftline")
        ("framerule" "2pt")
        ("rulecolor" "boxblue")
        ("baselinestretch" "1.2")))

(use-package org-ref
  :after org
  :config
  (define-key org-mode-map (kbd "C-c i c") org-ref-insert-cite-function)
  (define-key org-mode-map (kbd "C-c i r") org-ref-insert-ref-function)
  (define-key org-mode-map (kbd "C-c i l") org-ref-insert-label-function))

#+end_src

