content-org/all-posts.html
<div id="outline-container-org16d4611" class="outline-2">
<h2 id="org16d4611"><span class="section-number-2">10.</span> Org Mode</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Org-download
</span>(<span style="color: #51afef;">use-package</span> org-download
  <span style="color: #c678dd;">:after</span> org
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> org-download-heading-lvl nil)
  (<span style="color: #51afef;">setq</span> org-download-file-format-function
        (<span style="color: #51afef;">lambda</span> (filename)
          (<span style="color: #51afef;">let*</span> ((heading (org-get-heading t t t t))
                 (clean-heading (<span style="color: #51afef;">if</span> heading
                                    (replace-regexp-in-string <span style="color: #98be65;">"[</span><span style="color: #51afef; font-weight: bold;">^</span><span style="color: #98be65;">a-zA-Z0-9\u4e00-\u9fa5]+"</span> <span style="color: #98be65;">"-"</span> heading)
                                  <span style="color: #98be65;">"img"</span>))
                 (timestamp (format-time-string <span style="color: #98be65;">"%Y%m%d-%H%M%S"</span>))
                 (ext (file-name-extension filename)))
            (format <span style="color: #98be65;">"%s_%s.%s"</span> clean-heading timestamp ext))))
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#29992; advice &#24378;&#21046;&#35774;&#32622;&#20445;&#23384;&#30446;&#24405;
</span>  (advice-add 'org-download-screenshot <span style="color: #c678dd;">:before</span>
              (<span style="color: #51afef;">lambda</span> (<span style="color: #ECBE7B;">&amp;rest</span> _)
                (<span style="color: #51afef;">setq</span> org-download-image-dir
                      (<span style="color: #51afef;">let</span> ((dir (concat (file-name-sans-extension (buffer-file-name)) <span style="color: #98be65;">"/"</span>)))
                        (make-directory dir t)
                        dir)))))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Org-superstar
</span>(<span style="color: #51afef;">use-package</span> org-superstar
  <span style="color: #c678dd;">:after</span> org
  <span style="color: #c678dd;">:hook</span> (org-mode . org-superstar-mode)
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> org-superstar-headline-bullets-list '(?&#9673; ?&#9675; ?&#10040; ?&#10047; ?&#9670; ?&#9654;))
  (<span style="color: #51afef;">setq</span> org-superstar-item-bullet-alist '((?+ . ?&#10148;) (?* . ?&#8226;) (?- . ?&#8269;)))
  (<span style="color: #51afef;">with-eval-after-load</span> 'org-superstar
    (set-face-attribute 'org-superstar-item nil <span style="color: #c678dd;">:foreground</span> <span style="color: #98be65;">"#D7AF5F"</span>)
    (set-face-attribute 'org-superstar-leading nil <span style="color: #c678dd;">:foreground</span> <span style="color: #98be65;">"#7A6A3A"</span>))
  (<span style="color: #51afef;">setq</span> org-superstar-special-todo-items t)
  (<span style="color: #51afef;">setq</span> org-superstar-todo-bullet-alist '((<span style="color: #98be65;">"TODO"</span> . ?&#9744;) (<span style="color: #98be65;">"DONE"</span> . ?&#9745;) (<span style="color: #98be65;">"WAIT"</span> . ?&#10711;)))
  (<span style="color: #51afef;">setq</span> org-superstar-remove-leading-stars t))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Org-appear
</span>(<span style="color: #51afef;">use-package</span> org-appear
  <span style="color: #c678dd;">:after</span> org
  <span style="color: #c678dd;">:hook</span> (org-mode . org-appear-mode)
  <span style="color: #c678dd;">:custom</span>
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Org-present
</span>(<span style="color: #51afef;">use-package</span> org-present
  <span style="color: #c678dd;">:after</span> org
  <span style="color: #c678dd;">:bind</span> (<span style="color: #c678dd;">:map</span> org-present-mode-keymap
              (<span style="color: #98be65;">"C-c C-n"</span> . org-present-next)
              (<span style="color: #98be65;">"C-c C-p"</span> . org-present-prev)))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/org-present-start</span> ()
  (org-present-big)
  (<span style="color: #51afef;">setq</span> header-line-format <span style="color: #98be65;">" "</span>)
  (text-scale-set 3)
  (<span style="color: #51afef;">setq</span> cursor-type nil)
  (display-line-numbers-mode -1))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/org-present-end</span> ()
  (org-present-small)
  (<span style="color: #51afef;">setq</span> header-line-format nil)
  (text-scale-set 0)
  (<span style="color: #51afef;">setq</span> cursor-type 'bar)
  (display-line-numbers-mode 1))

(add-hook 'org-present-mode-hook #'my/org-present-start)
(add-hook 'org-present-mode-quit-hook #'my/org-present-end)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Org &#22522;&#30784;&#37197;&#32622;
</span>(<span style="color: #51afef;">setq</span> org-hide-emphasis-markers t)
(<span style="color: #51afef;">setq</span> org-hide-block-startup t)
(<span style="color: #51afef;">setq</span> org-startup-indented t)
(<span style="color: #51afef;">setq</span> org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-src-preserve-indentation t)
(<span style="color: #51afef;">setq</span> org-image-align 'center)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Org &#22270;&#29255;&#39044;&#35272;&#37197;&#32622;
</span>(<span style="color: #51afef;">setq</span> org-startup-with-inline-images t)
(<span style="color: #51afef;">setq</span> org-image-actual-width '(400))

(<span style="color: #51afef;">use-package</span> org-roam
  <span style="color: #c678dd;">:custom</span>
  (org-roam-directory (file-truename <span style="color: #98be65;">"~/Workspace/notes"</span>))
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-c n l"</span> . org-roam-buffer-toggle)
         (<span style="color: #98be65;">"C-c n f"</span> . org-roam-node-find)
         (<span style="color: #98be65;">"C-c n g"</span> . org-roam-graph)
         (<span style="color: #98be65;">"C-c n i"</span> . org-roam-node-insert)
         (<span style="color: #98be65;">"C-c n c"</span> . org-roam-capture)
         <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Dailies
</span>         (<span style="color: #98be65;">"C-c n j"</span> . org-roam-dailies-capture-today))
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> org-roam-node-display-template (concat <span style="color: #98be65;">"${title:*} "</span> (propertize <span style="color: #98be65;">"${tags:20}"</span> 'face 'org-tag)))
  (org-roam-db-autosync-mode)
  (<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">org-roam-dailies</span>)
  (<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">org-roam-protocol</span>))

(<span style="color: #51afef;">use-package</span> org-roam-ui
  <span style="color: #c678dd;">:after</span> org-roam
  <span style="color: #c678dd;">:custom</span>
  (org-roam-ui-sync-theme t)
  (org-roam-ui-follow t)
  (org-roam-ui-update-on-save t))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Org Babel
</span>(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (C . t)
   (python . t)
   (shell . t)))

<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">org_latex
</span>(setenv <span style="color: #98be65;">"TEXINPUTS"</span>
        (concat (expand-file-name <span style="color: #98be65;">"~/.emacs.d/latex/"</span>) <span style="color: #98be65;">":"</span>
                (getenv <span style="color: #98be65;">"TEXINPUTS"</span>)))

(<span style="color: #51afef;">setq</span> org-latex-image-default-width <span style="color: #98be65;">"0.6\\linewidth"</span>)

(<span style="color: #51afef;">with-eval-after-load</span> 'ox-latex
  (<span style="color: #51afef;">dolist</span> (cls '((<span style="color: #98be65;">"cs-note_org"</span> <span style="color: #98be65;">"\\documentclass{cs-note_org}
[NO-DEFAULT-PACKAGES]
[PACKAGES]
[EXTRA]"</span>)
                 (<span style="color: #98be65;">"note_org"</span> <span style="color: #98be65;">"\\documentclass{note_org}
[NO-DEFAULT-PACKAGES]
[PACKAGES]
[EXTRA]"</span>)))
    (add-to-list 'org-latex-classes
                 (append cls
                         '((<span style="color: #98be65;">"\\section{%s}"</span> . <span style="color: #98be65;">"\\section*{%s}"</span>)
                           (<span style="color: #98be65;">"\\subsection{%s}"</span> . <span style="color: #98be65;">"\\subsection*{%s}"</span>)
                           (<span style="color: #98be65;">"\\subsubsection{%s}"</span> . <span style="color: #98be65;">"\\subsubsection*{%s}"</span>))))))

(<span style="color: #51afef;">setq</span> org-latex-compiler <span style="color: #98be65;">"xelatex"</span>)
(<span style="color: #51afef;">setq</span> org-latex-pdf-process
      '(<span style="color: #98be65;">"xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
        <span style="color: #98be65;">"xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
        <span style="color: #98be65;">"xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#20351;&#29992; minted
</span>(<span style="color: #51afef;">setq</span> org-latex-listings 'minted)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#35821;&#35328;&#26144;&#23556;
</span>(<span style="color: #51afef;">with-eval-after-load</span> 'ox-latex
  (add-to-list 'org-latex-minted-langs '(emacs-lisp <span style="color: #98be65;">"common-lisp"</span>))
  (add-to-list 'org-latex-minted-langs '(elisp <span style="color: #98be65;">"common-lisp"</span>)))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">minted &#36873;&#39033;
</span>(<span style="color: #51afef;">setq</span> org-latex-minted-options
      '((<span style="color: #98be65;">"fontsize"</span> <span style="color: #98be65;">"\\small"</span>)
        (<span style="color: #98be65;">"breaklines"</span> <span style="color: #98be65;">"true"</span>)
        (<span style="color: #98be65;">"breakanywhere"</span> <span style="color: #98be65;">"true"</span>)
        (<span style="color: #98be65;">"bgcolor"</span> <span style="color: #98be65;">"boxback"</span>)
        (<span style="color: #98be65;">"frame"</span> <span style="color: #98be65;">"leftline"</span>)
        (<span style="color: #98be65;">"framerule"</span> <span style="color: #98be65;">"2pt"</span>)
        (<span style="color: #98be65;">"rulecolor"</span> <span style="color: #98be65;">"boxblue"</span>)
        (<span style="color: #98be65;">"baselinestretch"</span> <span style="color: #98be65;">"1.2"</span>)))

(<span style="color: #51afef;">use-package</span> org-ref
  <span style="color: #c678dd;">:after</span> org
  <span style="color: #c678dd;">:config</span>
  (define-key org-mode-map (kbd <span style="color: #98be65;">"C-c i c"</span>) org-ref-insert-cite-function)
  (define-key org-mode-map (kbd <span style="color: #98be65;">"C-c i r"</span>) org-ref-insert-ref-function)
  (define-key org-mode-map (kbd <span style="color: #98be65;">"C-c i l"</span>) org-ref-insert-label-function))

</code></pre>
</div>
</div>
</div>
