content-org/all-posts.org
* 开发工具

#+begin_src emacs-lisp
(use-package eglot
  :hook ((c-mode c-ts-mode c++-mode c++-ts-mode
                 python-mode java-mode java-ts-mode) . eglot-ensure)
  :config
  (setq eldoc-echo-area-use-multiline-p nil)
  (setq eglot-report-progress nil)
  (setq eglot-ignored-server-capabilities
        '(:hoverProvider :signatureHelpProvider))
  (setq eldoc-display-functions '(eldoc-display-in-buffer)))  ; 关掉底部错误显示

(use-package sideline-flymake
  :straight t
  :hook (flymake-mode . sideline-mode)
  :init
  (setq sideline-flymake-display-mode 'point
        sideline-backends-right '(sideline-flymake)
        sideline-backends-right-skip-current-line nil)
  :config
  ;; 修复 eglot 诊断类型不兼容的问题
  (defun sideline-flymake--show-errors (callback &rest _)
    "Execute CALLBACK to display with sideline."
    (when flymake-mode
      (when-let ((errors (sideline-flymake--get-errors)))
        (dolist (err errors)
          (let* ((text (flymake-diagnostic-text err))
                 (type (flymake-diagnostic-type err))
                 (face (cl-case type
                         ('eglot-error   'error)
                         ('eglot-warning 'warning)
                         (:error         'error)
                         (:warning       'warning)
                         (t              'success))))
            (add-face-text-property 0 (length text) face nil text)
            (funcall callback (list text))))))))

;; Copilot
(use-package copilot
  :straight (:host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
  :config
  (add-to-list 'copilot-indentation-alist '(prog-mode 2))
  (add-to-list 'copilot-indentation-alist '(org-mode 2))
  (add-to-list 'copilot-indentation-alist '(text-mode 2))
  (add-to-list 'copilot-indentation-alist '(clojure-mode 2))
  (add-to-list 'copilot-indentation-alist '(emacs-lisp-mode 2))
  (define-key copilot-completion-map (kbd "<tab>") 'copilot-accept-completion)
  (define-key copilot-completion-map (kbd "TAB") 'copilot-accept-completion))

;; YASnippet
(use-package yasnippet
  :hook (prog-mode . yas-minor-mode)
        (text-mode . yas-minor-mode)
  :config (yas-reload-all))

(use-package yasnippet-snippets
  :after yasnippet)

;; Magit
(use-package magit
  :commands (magit-status)
  :bind (("C-x g" . magit-status)))

;; Which-key
(use-package which-key
  :defer 1
  :config
  (which-key-mode 1)
  (setq which-key-idle-delay 0.4)
  (setq which-key-max-description-length 30)
  (setq which-key-sort-order 'which-key-key-order-alpha)
  (setq which-key-separator " → ")
  (setq which-key-prefix-prefix "+"))

;; Undo-tree（vim 风格有记忆的 undo）
(use-package undo-tree
  :config
  (global-undo-tree-mode)
  (setq undo-tree-auto-save-history t)
  (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo-tree/")))
  :bind (("C-/" . undo-tree-undo)
         ("C-?" . undo-tree-redo)
         ("C-x u" . undo-tree-visualize)))

#+end_src

* 自定义函数

#+begin_src emacs-lisp
(defun my-compile-and-run-c ()
  "编译并运行当前 C 文件"
  (interactive)
  (save-buffer)
  (let* ((file (buffer-file-name))
         (exe (file-name-sans-extension file)))
    (compile (format "gcc %s -o %s && %s" file exe exe))))

(global-set-key (kbd "C-c c") 'my-compile-and-run-c)
(global-set-key (kbd "C-c v") 'org-download-clipboard)

(provide 'init)
;;; init.el ends here
#+end_src
