content-org/all-posts.html
<div id="outline-container-orgbb576c4" class="outline-2">
<h2 id="orgbb576c4"><span class="section-number-2">11.</span> 开发工具</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="color: #51afef;">use-package</span> eglot
  <span style="color: #c678dd;">:hook</span> ((c-mode c-ts-mode c++-mode c++-ts-mode
                 python-mode java-mode java-ts-mode) <span style="color: #ECBE7B;">. eglot-ensure)</span>
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> eldoc-echo-area-use-multiline-p nil)
  (<span style="color: #51afef;">setq</span> eglot-report-progress nil)
  (<span style="color: #51afef;">setq</span> eglot-ignored-server-capabilities
        '(<span style="color: #c678dd;">:hoverProvider</span> <span style="color: #c678dd;">:signatureHelpProvider</span>))
  (<span style="color: #51afef;">setq</span> eldoc-display-functions '(eldoc-display-in-buffer)))  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">&#20851;&#25481;&#24213;&#37096;&#38169;&#35823;&#26174;&#31034;
</span>
(<span style="color: #51afef;">use-package</span> sideline-flymake
  <span style="color: #c678dd;">:straight</span> t
  <span style="color: #c678dd;">:hook</span> (flymake-mode . sideline-mode)
  <span style="color: #c678dd;">:init</span>
  (<span style="color: #51afef;">setq</span> sideline-flymake-display-mode 'point
        sideline-backends-right '(sideline-flymake)
        sideline-backends-right-skip-current-line nil)
  <span style="color: #c678dd;">:config</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#20462;&#22797; eglot &#35786;&#26029;&#31867;&#22411;&#19981;&#20860;&#23481;&#30340;&#38382;&#39064;
</span>  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">sideline-flymake--show-errors</span> (callback <span style="color: #ECBE7B;">&amp;rest</span> _)
    <span style="color: #83898d;">"Execute CALLBACK to display with sideline."</span>
    (<span style="color: #51afef;">when</span> flymake-mode
      (<span style="color: #51afef;">when-let</span> ((errors (sideline-flymake--get-errors)))
        (<span style="color: #51afef;">dolist</span> (err errors)
          (<span style="color: #51afef;">let*</span> ((text (flymake-diagnostic-text err))
                 (type (flymake-diagnostic-type err))
                 (face (<span style="color: #51afef;">cl-case</span> type
                         ('eglot-error   'error)
                         ('eglot-warning 'warning)
                         (<span style="color: #c678dd;">:error</span>         'error)
                         (<span style="color: #c678dd;">:warning</span>       'warning)
                         (t              'success))))
            (add-face-text-property 0 (length text) face nil text)
            (funcall callback (list text))))))))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Copilot
</span>(<span style="color: #51afef;">use-package</span> copilot
  <span style="color: #c678dd;">:straight</span> (<span style="color: #c678dd;">:host</span> github <span style="color: #c678dd;">:repo</span> <span style="color: #98be65;">"copilot-emacs/copilot.el"</span> <span style="color: #c678dd;">:files</span> (<span style="color: #98be65;">"*.el"</span>))
  <span style="color: #c678dd;">:config</span>
  (add-to-list 'copilot-indentation-alist '(prog-mode 2))
  (add-to-list 'copilot-indentation-alist '(org-mode 2))
  (add-to-list 'copilot-indentation-alist '(text-mode 2))
  (add-to-list 'copilot-indentation-alist '(clojure-mode 2))
  (add-to-list 'copilot-indentation-alist '(emacs-lisp-mode 2))
  (define-key copilot-completion-map (kbd <span style="color: #98be65;">"&lt;tab&gt;"</span>) 'copilot-accept-completion)
  (define-key copilot-completion-map (kbd <span style="color: #98be65;">"TAB"</span>) 'copilot-accept-completion))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">YASnippet
</span>(<span style="color: #51afef;">use-package</span> yasnippet
  <span style="color: #c678dd;">:hook</span> (prog-mode . yas-minor-mode)
        (text-mode . yas-minor-mode)
  <span style="color: #c678dd;">:config</span> (yas-reload-all))

(<span style="color: #51afef;">use-package</span> yasnippet-snippets
  <span style="color: #c678dd;">:after</span> yasnippet)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Magit
</span>(<span style="color: #51afef;">use-package</span> magit
  <span style="color: #c678dd;">:commands</span> (magit-status)
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-x g"</span> . magit-status)))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Which-key
</span>(<span style="color: #51afef;">use-package</span> which-key
  <span style="color: #c678dd;">:defer</span> 1
  <span style="color: #c678dd;">:config</span>
  (which-key-mode 1)
  (<span style="color: #51afef;">setq</span> which-key-idle-delay 0.4)
  (<span style="color: #51afef;">setq</span> which-key-max-description-length 30)
  (<span style="color: #51afef;">setq</span> which-key-sort-order 'which-key-key-order-alpha)
  (<span style="color: #51afef;">setq</span> which-key-separator <span style="color: #98be65;">" &#8594; "</span>)
  (<span style="color: #51afef;">setq</span> which-key-prefix-prefix <span style="color: #98be65;">"+"</span>))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Undo-tree&#65288;vim &#39118;&#26684;&#26377;&#35760;&#24518;&#30340; undo&#65289;
</span>(<span style="color: #51afef;">use-package</span> undo-tree
  <span style="color: #c678dd;">:config</span>
  (global-undo-tree-mode)
  (<span style="color: #51afef;">setq</span> undo-tree-auto-save-history t)
  (<span style="color: #51afef;">setq</span> undo-tree-history-directory-alist '((<span style="color: #98be65;">"."</span> . <span style="color: #98be65;">"~/.emacs.d/undo-tree/"</span>)))
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-/"</span> . undo-tree-undo)
         (<span style="color: #98be65;">"C-?"</span> . undo-tree-redo)
         (<span style="color: #98be65;">"C-x u"</span> . undo-tree-visualize)))

</code></pre>
</div>
</div>
</div>
<div id="outline-container-org9b5680e" class="outline-2">
<h2 id="org9b5680e"><span class="section-number-2">12.</span> 自定义函数</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my-compile-and-run-c</span> ()
  <span style="color: #83898d;">"&#32534;&#35793;&#24182;&#36816;&#34892;&#24403;&#21069; C &#25991;&#20214;"</span>
  (<span style="color: #51afef;">interactive</span>)
  (save-buffer)
  (<span style="color: #51afef;">let*</span> ((file (buffer-file-name))
         (exe (file-name-sans-extension file)))
    (compile (format <span style="color: #98be65;">"gcc %s -o %s &amp;&amp; %s"</span> file exe exe))))

(global-set-key (kbd <span style="color: #98be65;">"C-c c"</span>) 'my-compile-and-run-c)
(global-set-key (kbd <span style="color: #98be65;">"C-c v"</span>) 'org-download-clipboard)

(<span style="color: #51afef;">provide</span> '<span style="color: #a9a1e1;">init</span>)
<span style="color: #5B6268;">;;; </span><span style="color: #5B6268;">init.el ends here</span>
</code></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 罗耀辉</p>
<p class="date">Created: 2026-03-21 Sat 19:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
